IDEA StatiCa Open Model
SteelSetupAUS Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Steel setup IBC class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupAUS
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class SteelSetupAUS : SteelSetup
Public Class SteelSetupAUS
	Inherits SteelSetup
public ref class SteelSetupAUS : public SteelSetup
The SteelSetupAUS type exposes the following members.
Constructors
Name | Description
SteelSetupAUS
Initializes a new instance of the SteelSetupAUS class
Top
Properties
Name | Description
Anchor_Fiar
 Safety factor Anchor_Fiar
Bolt_Fib
 Safety factor Bolt_Fib
Bolt_Fip
 Safety factor preloaded bolt
CrtBearing
 Concrete bearing factor
Structural_Fi
 Safety factor Structural_Fi
Weld_Fiw
 Safety factor Weld_Fiw
Top
Methods
Name | Description
FrictionCoefficientPboltDefault
 Friction Coefficient Pbolt Default
 (Overrides SteelSetup.FrictionCoefficientPboltDefault().)
Top
See Also
Reference
IdeaRS.OpenModel Namespace